mister-cocktail/app/views/cocktails/_list_ingredients.html.erb

SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 10]]
---
  <div class="list-group">
    <% @cocktail.doses.each do |dose| %>