mister-cocktail/app/controllers/cocktails_controller.rb

  def create
    @cocktail = Cocktail.new(cocktails_params)
    if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdasd"], ["created_at", "2015-02-19 16:00:16.936850"], ["updated_at", "2015-02-19 16:00:16.936850"]]

  def update
    @cocktail.update(cocktails_params)
---
UPDATE "cocktails" SET "name" = $1, "updated_at" = $2 WHERE "cocktails"."id" = $3  [["name", "Black Velvet2"], ["updated_at", "2015-02-19 18:14:25.283219"], ["id", 6]]

  def destroy
    @cocktail.destroy
---
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 3]]

  def set_cocktail
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 6]]