mister-cocktail/app/controllers/doses_controller.rb

  def new
    @dose = Dose.new
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def create
    @dose = @cocktail.doses.build(dose_params)
    if @dose.save
---
INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "n,,m,"], ["ingredient_id", 1], ["cocktail_id", 10], ["created_at", "2015-02-20 20:19:04.779292"], ["updated_at", "2015-02-20 20:19:04.779292"]]

  def destroy
    @cocktail.doses.find(params[:id]).destroy
---
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 2]]
SELECT  "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1 AND "doses"."id" = $2 LIMIT 1  [["cocktail_id", 10], ["id", 2]]

  def find_cocktail
    @cocktail = Cocktail.find(params[:cocktail_id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 10]]